app/views/photos/index.html.erb

SELECT "comments".* FROM "comments"
---
          <% if user.id == comment.user_id %>
            <a href= "/photos/index/<%= user.id %>"><%= user.first_name %> <%= user.last_name %> </a>(<%= comment.created_at.to_s(:db) %>): <br> <%= comment.comment_text %><br><br>