app/controllers/photos_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "photos".* FROM "photos"
SELECT "comments".* FROM "comments"
---
  def index
    @students=User.all
    @student=User.find(params[:id])
    @photos=Photo.all
    @id_var=params[:id]
    @comments=Comment.all