app/controllers/users_controller.rb

  def index
    @students = User.all
---
SELECT "users".* FROM "users"